use Nev_MyBase
--1
Select min(Цена_заказанного_товара)[Минимальная цена заказа],
	   max(Цена_заказанного_товара)[Максимальная цена заказа],
	   count(*)[Количество заказов],
	   sum(Цена_заказанного_товара)[Заказы на общую сумму]
From ЗАКАЗЫ

--2
Select ЗАКАЗЫ.ID_товара,
max(Цена_заказанного_товара)[Максимальная цена заказа],
count(*)[Количество заказов]
From ЗАКАЗЫ  Inner Join ТОВАРЫ
On ЗАКАЗЫ.ID_товара=ТОВАРЫ.ID_товара
And ТОВАРЫ.Цена>100 Group by ЗАКАЗЫ.ID_товара

--3
Select*
From(select Case when Цена_заказанного_товара between 1 and 51 then 'цена <51'
when Цена_заказанного_товара between 51 and 101 then 'цена от 51 до 101'
else 'цена больше 101'
end [Пределы цен], Count(*)[Количество]
From ЗАКАЗЫ Group by Case
when Цена_заказанного_товара between 1 and 51 then 'цена <51'
when Цена_заказанного_товара between 51 and 101 then 'цена от 51 до 101'
else 'цена больше 101'
end) as T
ORDER BY Case [Пределы цен]
when 'цена <51' then 3
when 'цена от 51 до 101' then 2
when 'цена больше 101' then 1
else 0
end
--4
Select g.ID_товара,
	   f.Цена,
	   round(avg (cast(g.Цена_заказанного_товара as float(4))),2)[Средняя цена при продаже]
From ТОВАРЫ f inner join ЗАКАЗЫ g
on f.ID_товара=g.ID_товара 
GROUP BY  g.ID_товара,
	   f.Цена


--5
Select ID_товара, Цена_заказанного_товара, sum(Количество_заказнного_товара)Количество_заказнного_товара
From ЗАКАЗЫ
Where ID_товара in('111','222')
Group by ID_товара, Цена_заказанного_товара;
--
Select ID_товара, Цена_заказанного_товара, sum(Количество_заказнного_товара)Количество_заказнного_товара
From ЗАКАЗЫ
Where ID_товара in('111','222')
Group by rollup (ID_товара, Цена_заказанного_товара);

--6
Select ID_товара, Цена_заказанного_товара, sum(Количество_заказнного_товара)Количество_заказнного_товара
From ЗАКАЗЫ
Where ID_товара in('111','222')
Group by cube (ID_товара, Цена_заказанного_товара);

--7
Select ID_товара, sum(Количество_заказнного_товара)Количество_заказнного_товара
From ЗАКАЗЫ
Where ID_товара='111'
Group by ID_товара
UNION
Select ID_товара, sum(Количество_заказнного_товара)Количество_заказнного_товара
From ЗАКАЗЫ
Where ID_товара='222'
Group by ID_товара

--8
Select ID_товара, sum(Количество_заказнного_товара)Количество_заказнного_товара
From ЗАКАЗЫ
Where ID_товара='111'
Group by ID_товара
Intersect
Select ID_товара, sum(Количество_заказнного_товара)Количество_заказнного_товара
From ЗАКАЗЫ
Where ID_товара='222'
Group by ID_товара

--9
Select ID_товара, sum(Количество_заказнного_товара)Количество_заказнного_товара
From ЗАКАЗЫ
Where ID_товара='111'
Group by ID_товара
except
Select ID_товара, sum(Количество_заказнного_товара)Количество_заказнного_товара
From ЗАКАЗЫ
Where ID_товара='222'
Group by ID_товара
--10
select p1.ID_товара, p1.Цена_заказанного_товара,
(select COUNT(*) from ЗАКАЗЫ p2
Where p2.ID_товара=p1.ID_товара
and p2.Цена_заказанного_товара=p1.Цена_заказанного_товара)[количество]
From ЗАКАЗЫ p1
Group by p1.ID_товара, p1.Цена_заказанного_товара
having Цена_заказанного_товара<51 or Цена_заказанного_товара>100