use Nev_MyBase;
--1
SELECT ЗАКАЗЫ.ID_товара, ЗАКАЗЫ.Дата_продажи, ТОВАРЫ.Цена
FROM ЗАКАЗЫ, ТОВАРЫ, ЗАКАЗЧИКИ
Where ЗАКАЗЫ.ID_товара=ТОВАРЫ.ID_товара and ЗАКАЗЧИКИ.ID_Заказчика=ЗАКАЗЫ.ID_Заказчика
and ЗАКАЗЧИКИ.Имя in( select ЗАКАЗЧИКИ.Имя from ЗАКАЗЧИКИ 
							Where (ID_Заказчика Like '%1234%'))
--2
Select 
ЗАКАЗЫ.ID_товара, ЗАКАЗЫ.Дата_продажи, ТОВАРЫ.Цена
FROM ЗАКАЗЫ Inner Join ТОВАРЫ
on ЗАКАЗЫ.ID_товара=ТОВАРЫ.ID_товара,ЗАКАЗЧИКИ
where ЗАКАЗЫ.ID_товара=ТОВАРЫ.ID_товара and ЗАКАЗЧИКИ.ID_Заказчика=ЗАКАЗЫ.ID_Заказчика
and
ЗАКАЗЧИКИ.Имя in( select ЗАКАЗЧИКИ.Имя from ЗАКАЗЧИКИ 
							Where (ID_Заказчика Like '%1234%'))

--3
Select 
ЗАКАЗЫ.ID_товара, ЗАКАЗЫ.Дата_продажи, ТОВАРЫ.Цена
FROM ЗАКАЗЫ Inner Join ТОВАРЫ
on ЗАКАЗЫ.ID_товара=ТОВАРЫ.ID_товара
Inner Join ЗАКАЗЧИКИ
on ЗАКАЗЧИКИ.ID_Заказчика=ЗАКАЗЫ.ID_Заказчика
where(ЗАКАЗЧИКИ.ID_Заказчика Like '%1234%')

--4

Select  ID_товара, Цена_заказанного_товара
FROM ЗАКАЗЫ as a
where  ID_Заказчика=(select top(1) aa.ID_Заказчика from
ЗАКАЗЫ as aa where aa.ID_товара=a.ID_товара 
					order by Цена_заказанного_товара desc)

--5
Select ID_товара from ТОВАРЫ
Where not exists( select * from ЗАКАЗЫ
Where ЗАКАЗЫ.ID_товара=ТОВАРЫ.ID_товара)

--6
Select top 1
(select avg(Цена_заказанного_товара) from ЗАКАЗЫ
			where ID_товара like '111')[Астра],
(select avg(Цена_заказанного_товара) from ЗАКАЗЫ
			where ID_товара like '222')[Гвоздики]
From ТОВАРЫ

--7
Select ID_товара, Цена_заказанного_товара from ЗАКАЗЫ
where Цена_заказанного_товара >= all(select  Цена_заказанного_товара from ЗАКАЗЫ
where  ID_товара like '3%')

--8
Select ID_товара, Цена_заказанного_товара from ЗАКАЗЫ
where Цена_заказанного_товара >= any(select  Цена_заказанного_товара from ЗАКАЗЫ
where  ID_товара like '1%')