use NE_MyBASE
INSERT into ЗАКАЗЧИКИ(ID_Заказчика, Фамилия, Имя, Отчество, Адрес,Телефон,Mail, Sold)
Values('1234','Пук','Пук','Пук','Гагарина','+375333834114','eugene@gmail.com','да'),
('30303','Тык','Тык','Тык','Белорусская','+375323456783','Kol@gmail.com','нет');
INSERT into ТОВАРЫ(ID_товара,Название_товаров, Цена, Количество_на_складе, Единица_измерения)
Values(345,'Ландыши',15,10000,'шт'),(1955,'Ромашки',150,1300,'шт');
INSERT into ЗАКАЗЫ(Номер_заказа,Дата_продажи, ID_товара, Цена_заказанного_товара,Количество_заказанного_товара,ID_Заказчика)
Values('1','2023-3-7',345,30,2,'1234'),('2','2020-4-7',1955,300,2,'30303');
